zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/matrix.h
/**
 * \brief Component description for PIC32CZ/CA70 MATRIX
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_MATRIX_COMPONENT_H_
#define _PIC32CZ_CA70_MATRIX_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_MATRIX AHB Bus Matrix
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR MATRIX */
/* ========================================================================== */

/* -------- MATRIX_PRAS : (MATRIX Offset: 0x00) (R/W 32) Priority Register A for Slave 0 -------- */

typedef union
{
  struct
  {
    uint32_t M0PR:2;                    /**< bit:   0..1  Master 0 Priority                             */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t M1PR:2;                    /**< bit:   4..5  Master 1 Priority                             */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t M2PR:2;                    /**< bit:   8..9  Master 2 Priority                             */
    uint32_t :2;                        /**< bit: 10..11  Reserved                                      */
    uint32_t M3PR:2;                    /**< bit: 12..13  Master 3 Priority                             */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t M4PR:2;                    /**< bit: 16..17  Master 4 Priority                             */
    uint32_t :2;                        /**< bit: 18..19  Reserved                                      */
    uint32_t M5PR:2;                    /**< bit: 20..21  Master 5 Priority                             */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t M6PR:2;                    /**< bit: 24..25  Master 6 Priority                             */
    uint32_t :2;                        /**< bit: 26..27  Reserved                                      */
    uint32_t M7PR:2;                    /**< bit: 28..29  Master 7 Priority                             */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __MATRIX_PRAS_bits_t;

#define MATRIX_PRAS_M0PR_Pos                  (0)                                            /**< (MATRIX_PRAS) Master 0 Priority Position */
#define MATRIX_PRAS_M0PR_Msk                  (0x3U << MATRIX_PRAS_M0PR_Pos)                 /**< (MATRIX_PRAS) Master 0 Priority Mask */
#define MATRIX_PRAS_M0PR(value)               (MATRIX_PRAS_M0PR_Msk & ((value) << MATRIX_PRAS_M0PR_Pos))
#define MATRIX_PRAS_M1PR_Pos                  (4)                                            /**< (MATRIX_PRAS) Master 1 Priority Position */
#define MATRIX_PRAS_M1PR_Msk                  (0x3U << MATRIX_PRAS_M1PR_Pos)                 /**< (MATRIX_PRAS) Master 1 Priority Mask */
#define MATRIX_PRAS_M1PR(value)               (MATRIX_PRAS_M1PR_Msk & ((value) << MATRIX_PRAS_M1PR_Pos))
#define MATRIX_PRAS_M2PR_Pos                  (8)                                            /**< (MATRIX_PRAS) Master 2 Priority Position */
#define MATRIX_PRAS_M2PR_Msk                  (0x3U << MATRIX_PRAS_M2PR_Pos)                 /**< (MATRIX_PRAS) Master 2 Priority Mask */
#define MATRIX_PRAS_M2PR(value)               (MATRIX_PRAS_M2PR_Msk & ((value) << MATRIX_PRAS_M2PR_Pos))
#define MATRIX_PRAS_M3PR_Pos                  (12)                                           /**< (MATRIX_PRAS) Master 3 Priority Position */
#define MATRIX_PRAS_M3PR_Msk                  (0x3U << MATRIX_PRAS_M3PR_Pos)                 /**< (MATRIX_PRAS) Master 3 Priority Mask */
#define MATRIX_PRAS_M3PR(value)               (MATRIX_PRAS_M3PR_Msk & ((value) << MATRIX_PRAS_M3PR_Pos))
#define MATRIX_PRAS_M4PR_Pos                  (16)                                           /**< (MATRIX_PRAS) Master 4 Priority Position */
#define MATRIX_PRAS_M4PR_Msk                  (0x3U << MATRIX_PRAS_M4PR_Pos)                 /**< (MATRIX_PRAS) Master 4 Priority Mask */
#define MATRIX_PRAS_M4PR(value)               (MATRIX_PRAS_M4PR_Msk & ((value) << MATRIX_PRAS_M4PR_Pos))
#define MATRIX_PRAS_M5PR_Pos                  (20)                                           /**< (MATRIX_PRAS) Master 5 Priority Position */
#define MATRIX_PRAS_M5PR_Msk                  (0x3U << MATRIX_PRAS_M5PR_Pos)                 /**< (MATRIX_PRAS) Master 5 Priority Mask */
#define MATRIX_PRAS_M5PR(value)               (MATRIX_PRAS_M5PR_Msk & ((value) << MATRIX_PRAS_M5PR_Pos))
#define MATRIX_PRAS_M6PR_Pos                  (24)                                           /**< (MATRIX_PRAS) Master 6 Priority Position */
#define MATRIX_PRAS_M6PR_Msk                  (0x3U << MATRIX_PRAS_M6PR_Pos)                 /**< (MATRIX_PRAS) Master 6 Priority Mask */
#define MATRIX_PRAS_M6PR(value)               (MATRIX_PRAS_M6PR_Msk & ((value) << MATRIX_PRAS_M6PR_Pos))
#define MATRIX_PRAS_M7PR_Pos                  (28)                                           /**< (MATRIX_PRAS) Master 7 Priority Position */
#define MATRIX_PRAS_M7PR_Msk                  (0x3U << MATRIX_PRAS_M7PR_Pos)                 /**< (MATRIX_PRAS) Master 7 Priority Mask */
#define MATRIX_PRAS_M7PR(value)               (MATRIX_PRAS_M7PR_Msk & ((value) << MATRIX_PRAS_M7PR_Pos))
#define MATRIX_PRAS_Msk                       (0x33333333UL)                                 /**< (MATRIX_PRAS) Register Mask  */

/* -------- MATRIX_PRBS : (MATRIX Offset: 0x04) (R/W 32) Priority Register B for Slave 0 -------- */

typedef union
{
  struct
  {
    uint32_t M8PR:2;                    /**< bit:   0..1  Master 8 Priority                             */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t M9PR:2;                    /**< bit:   4..5  Master 9 Priority                             */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t M10PR:2;                   /**< bit:   8..9  Master 10 Priority                            */
    uint32_t :2;                        /**< bit: 10..11  Reserved                                      */
    uint32_t M11PR:2;                   /**< bit: 12..13  Master 11 Priority                            */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t M12PR:2;                   /**< bit: 16..17  Master 12 Priority                            */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __MATRIX_PRBS_bits_t;

