zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/matrix.h
#define MATRIX_SCFG_SLOT_CYCLE_Pos            (0)                                            /**< (MATRIX_SCFG) Maximum Bus Grant Duration for Masters Position */
#define MATRIX_SCFG_SLOT_CYCLE_Msk            (0x1FFU << MATRIX_SCFG_SLOT_CYCLE_Pos)         /**< (MATRIX_SCFG) Maximum Bus Grant Duration for Masters Mask */
#define MATRIX_SCFG_SLOT_CYCLE(value)         (MATRIX_SCFG_SLOT_CYCLE_Msk & ((value) << MATRIX_SCFG_SLOT_CYCLE_Pos))
#define MATRIX_SCFG_DEFMSTR_TYPE_Pos          (16)                                           /**< (MATRIX_SCFG) Default Master Type Position */
#define MATRIX_SCFG_DEFMSTR_TYPE_Msk          (0x3U << MATRIX_SCFG_DEFMSTR_TYPE_Pos)         /**< (MATRIX_SCFG) Default Master Type Mask */
#define MATRIX_SCFG_DEFMSTR_TYPE(value)       (MATRIX_SCFG_DEFMSTR_TYPE_Msk & ((value) << MATRIX_SCFG_DEFMSTR_TYPE_Pos))
#define   MATRIX_SCFG_DEFMSTR_TYPE_NONE_Val   (0x0U)                                         /**< (MATRIX_SCFG) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access.  */
#define   MATRIX_SCFG_DEFMSTR_TYPE_LAST_Val   (0x1U)                                         /**< (MATRIX_SCFG) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again.  */
#define   MATRIX_SCFG_DEFMSTR_TYPE_FIXED_Val  (0x2U)                                         /**< (MATRIX_SCFG) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again.  */
#define MATRIX_SCFG_DEFMSTR_TYPE_NONE         (MATRIX_SCFG_DEFMSTR_TYPE_NONE_Val << MATRIX_SCFG_DEFMSTR_TYPE_Pos)  /**< (MATRIX_SCFG) No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access. Position  */
#define MATRIX_SCFG_DEFMSTR_TYPE_LAST         (MATRIX_SCFG_DEFMSTR_TYPE_LAST_Val << MATRIX_SCFG_DEFMSTR_TYPE_Pos)  /**< (MATRIX_SCFG) Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again. Position  */
#define MATRIX_SCFG_DEFMSTR_TYPE_FIXED        (MATRIX_SCFG_DEFMSTR_TYPE_FIXED_Val << MATRIX_SCFG_DEFMSTR_TYPE_Pos)  /**< (MATRIX_SCFG) Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again. Position  */
#define MATRIX_SCFG_FIXED_DEFMSTR_Pos         (18)                                           /**< (MATRIX_SCFG) Fixed Default Master Position */
#define MATRIX_SCFG_FIXED_DEFMSTR_Msk         (0xFU << MATRIX_SCFG_FIXED_DEFMSTR_Pos)        /**< (MATRIX_SCFG) Fixed Default Master Mask */
#define MATRIX_SCFG_FIXED_DEFMSTR(value)      (MATRIX_SCFG_FIXED_DEFMSTR_Msk & ((value) << MATRIX_SCFG_FIXED_DEFMSTR_Pos))
#define MATRIX_SCFG_Msk                       (0x003F01FFUL)                                 /**< (MATRIX_SCFG) Register Mask  */

/* -------- MATRIX_MRCR : (MATRIX Offset: 0x100) (R/W 32) Master Remap Control Register -------- */

typedef union
{
  struct
  {
    uint32_t RCB0:1;                    /**< bit:      0  Remap Command Bit for Master 0                */
    uint32_t RCB1:1;                    /**< bit:      1  Remap Command Bit for Master 1                */
    uint32_t RCB2:1;                    /**< bit:      2  Remap Command Bit for Master 2                */
    uint32_t RCB3:1;                    /**< bit:      3  Remap Command Bit for Master 3                */
    uint32_t RCB4:1;                    /**< bit:      4  Remap Command Bit for Master 4                */
    uint32_t RCB5:1;                    /**< bit:      5  Remap Command Bit for Master 5                */
    uint32_t RCB6:1;                    /**< bit:      6  Remap Command Bit for Master 6                */
    uint32_t RCB7:1;                    /**< bit:      7  Remap Command Bit for Master 7                */
    uint32_t RCB8:1;                    /**< bit:      8  Remap Command Bit for Master 8                */
    uint32_t RCB9:1;                    /**< bit:      9  Remap Command Bit for Master 9                */
    uint32_t RCB10:1;                   /**< bit:     10  Remap Command Bit for Master 10               */
    uint32_t RCB11:1;                   /**< bit:     11  Remap Command Bit for Master 11               */
    uint32_t RCB12:1;                   /**< bit:     12  Remap Command Bit for Master 12               */
    uint32_t :19;                       /**< bit: 13..31  Reserved                                      */
  };
  struct
  {
    uint32_t RCB:13;                    /**< bit:  0..12  Remap Command Bit for Master x2               */
    uint32_t :19;                       /**< bit: 13..31  Reserved                                      */
  };
  uint32_t w;
} __MATRIX_MRCR_bits_t;

#define MATRIX_MRCR_RCB0_Pos                  (0)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 0 Position */
#define MATRIX_MRCR_RCB0_Msk                  (0x1U << MATRIX_MRCR_RCB0_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 0 Mask */
#define MATRIX_MRCR_RCB1_Pos                  (1)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 1 Position */
#define MATRIX_MRCR_RCB1_Msk                  (0x1U << MATRIX_MRCR_RCB1_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 1 Mask */
#define MATRIX_MRCR_RCB2_Pos                  (2)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 2 Position */
#define MATRIX_MRCR_RCB2_Msk                  (0x1U << MATRIX_MRCR_RCB2_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 2 Mask */
#define MATRIX_MRCR_RCB3_Pos                  (3)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 3 Position */
#define MATRIX_MRCR_RCB3_Msk                  (0x1U << MATRIX_MRCR_RCB3_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 3 Mask */
#define MATRIX_MRCR_RCB4_Pos                  (4)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 4 Position */
#define MATRIX_MRCR_RCB4_Msk                  (0x1U << MATRIX_MRCR_RCB4_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 4 Mask */
#define MATRIX_MRCR_RCB5_Pos                  (5)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 5 Position */
#define MATRIX_MRCR_RCB5_Msk                  (0x1U << MATRIX_MRCR_RCB5_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 5 Mask */
#define MATRIX_MRCR_RCB6_Pos                  (6)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 6 Position */
#define MATRIX_MRCR_RCB6_Msk                  (0x1U << MATRIX_MRCR_RCB6_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 6 Mask */
#define MATRIX_MRCR_RCB7_Pos                  (7)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 7 Position */
#define MATRIX_MRCR_RCB7_Msk                  (0x1U << MATRIX_MRCR_RCB7_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 7 Mask */
#define MATRIX_MRCR_RCB8_Pos                  (8)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 8 Position */
#define MATRIX_MRCR_RCB8_Msk                  (0x1U << MATRIX_MRCR_RCB8_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 8 Mask */
#define MATRIX_MRCR_RCB9_Pos                  (9)                                            /**< (MATRIX_MRCR) Remap Command Bit for Master 9 Position */
#define MATRIX_MRCR_RCB9_Msk                  (0x1U << MATRIX_MRCR_RCB9_Pos)                 /**< (MATRIX_MRCR) Remap Command Bit for Master 9 Mask */
#define MATRIX_MRCR_RCB10_Pos                 (10)                                           /**< (MATRIX_MRCR) Remap Command Bit for Master 10 Position */
#define MATRIX_MRCR_RCB10_Msk                 (0x1U << MATRIX_MRCR_RCB10_Pos)                /**< (MATRIX_MRCR) Remap Command Bit for Master 10 Mask */
#define MATRIX_MRCR_RCB11_Pos                 (11)                                           /**< (MATRIX_MRCR) Remap Command Bit for Master 11 Position */
#define MATRIX_MRCR_RCB11_Msk                 (0x1U << MATRIX_MRCR_RCB11_Pos)                /**< (MATRIX_MRCR) Remap Command Bit for Master 11 Mask */
#define MATRIX_MRCR_RCB12_Pos                 (12)                                           /**< (MATRIX_MRCR) Remap Command Bit for Master 12 Position */
#define MATRIX_MRCR_RCB12_Msk                 (0x1U << MATRIX_MRCR_RCB12_Pos)                /**< (MATRIX_MRCR) Remap Command Bit for Master 12 Mask */
#define MATRIX_MRCR_Msk                       (0x00001FFFUL)                                 /**< (MATRIX_MRCR) Register Mask  */
#define MATRIX_MRCR_RCB_Pos                   (0)                                            /**< (MATRIX_MRCR Position) Remap Command Bit for Master x2 */
#define MATRIX_MRCR_RCB_Msk                   (0x1FFFU << MATRIX_MRCR_RCB_Pos)               /**< (MATRIX_MRCR Mask) RCB */
#define MATRIX_MRCR_RCB(value)                (MATRIX_MRCR_RCB_Msk & ((value) << MATRIX_MRCR_RCB_Pos))

/* -------- CCFG_CAN0 : (MATRIX Offset: 0x110) (R/W 32) CAN0 Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :16;                       /**< bit:  0..15  Reserved                                      */
    uint32_t CAN0DMABA:16;              /**< bit: 16..31  CAN0 DMA Base Address                         */
  };
  uint32_t w;
} __CCFG_CAN0_bits_t;

#define CCFG_CAN0_CAN0DMABA_Pos               (16)                                           /**< (CCFG_CAN0) CAN0 DMA Base Address Position */
#define CCFG_CAN0_CAN0DMABA_Msk               (0xFFFFU << CCFG_CAN0_CAN0DMABA_Pos)           /**< (CCFG_CAN0) CAN0 DMA Base Address Mask */
#define CCFG_CAN0_CAN0DMABA(value)            (CCFG_CAN0_CAN0DMABA_Msk & ((value) << CCFG_CAN0_CAN0DMABA_Pos))
#define CCFG_CAN0_Msk                         (0xFFFF0000UL)                                 /**< (CCFG_CAN0) Register Mask  */

/* -------- CCFG_SYSIO : (MATRIX Offset: 0x114) (R/W 32) System I/O and CAN1 Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t SYSIO4:1;                  /**< bit:      4  PB4 or TDI Assignment                         */
    uint32_t SYSIO5:1;                  /**< bit:      5  PB5 or TDO/TRACESWO Assignment                */
    uint32_t SYSIO6:1;                  /**< bit:      6  PB6 or TMS/SWDIO Assignment                   */
    uint32_t SYSIO7:1;                  /**< bit:      7  PB7 or TCK/SWCLK Assignment                   */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t SYSIO12:1;                 /**< bit:     12  PB12 or ERASE Assignment                      */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t CAN1DMABA:16;              /**< bit: 16..31  CAN1 DMA Base Address                         */
  };
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t SYSIO:5;                   /**< bit:   4..8  PB4 or TDI Assignment                         */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __CCFG_SYSIO_bits_t;

