zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/matrix.h
#define CCFG_SYSIO_SYSIO4_Pos                 (4)                                            /**< (CCFG_SYSIO) PB4 or TDI Assignment Position */
#define CCFG_SYSIO_SYSIO4_Msk                 (0x1U << CCFG_SYSIO_SYSIO4_Pos)                /**< (CCFG_SYSIO) PB4 or TDI Assignment Mask */
#define CCFG_SYSIO_SYSIO5_Pos                 (5)                                            /**< (CCFG_SYSIO) PB5 or TDO/TRACESWO Assignment Position */
#define CCFG_SYSIO_SYSIO5_Msk                 (0x1U << CCFG_SYSIO_SYSIO5_Pos)                /**< (CCFG_SYSIO) PB5 or TDO/TRACESWO Assignment Mask */
#define CCFG_SYSIO_SYSIO6_Pos                 (6)                                            /**< (CCFG_SYSIO) PB6 or TMS/SWDIO Assignment Position */
#define CCFG_SYSIO_SYSIO6_Msk                 (0x1U << CCFG_SYSIO_SYSIO6_Pos)                /**< (CCFG_SYSIO) PB6 or TMS/SWDIO Assignment Mask */
#define CCFG_SYSIO_SYSIO7_Pos                 (7)                                            /**< (CCFG_SYSIO) PB7 or TCK/SWCLK Assignment Position */
#define CCFG_SYSIO_SYSIO7_Msk                 (0x1U << CCFG_SYSIO_SYSIO7_Pos)                /**< (CCFG_SYSIO) PB7 or TCK/SWCLK Assignment Mask */
#define CCFG_SYSIO_SYSIO12_Pos                (12)                                           /**< (CCFG_SYSIO) PB12 or ERASE Assignment Position */
#define CCFG_SYSIO_SYSIO12_Msk                (0x1U << CCFG_SYSIO_SYSIO12_Pos)               /**< (CCFG_SYSIO) PB12 or ERASE Assignment Mask */
#define CCFG_SYSIO_CAN1DMABA_Pos              (16)                                           /**< (CCFG_SYSIO) CAN1 DMA Base Address Position */
#define CCFG_SYSIO_CAN1DMABA_Msk              (0xFFFFU << CCFG_SYSIO_CAN1DMABA_Pos)          /**< (CCFG_SYSIO) CAN1 DMA Base Address Mask */
#define CCFG_SYSIO_CAN1DMABA(value)           (CCFG_SYSIO_CAN1DMABA_Msk & ((value) << CCFG_SYSIO_CAN1DMABA_Pos))
#define CCFG_SYSIO_Msk                        (0xFFFF10F0UL)                                 /**< (CCFG_SYSIO) Register Mask  */
#define CCFG_SYSIO_SYSIO_Pos                  (4)                                            /**< (CCFG_SYSIO Position) PB4 or TDI Assignment */
#define CCFG_SYSIO_SYSIO_Msk                  (0x1FU << CCFG_SYSIO_SYSIO_Pos)                /**< (CCFG_SYSIO Mask) SYSIO */
#define CCFG_SYSIO_SYSIO(value)               (CCFG_SYSIO_SYSIO_Msk & ((value) << CCFG_SYSIO_SYSIO_Pos))

/* -------- CCFG_PCCR : (MATRIX Offset: 0x118) (R/W 32) Peripheral Clock Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t :20;                       /**< bit:  0..19  Reserved                                      */
    uint32_t TC0CC:1;                   /**< bit:     20  TC0 Clock Configuration                       */
    uint32_t I2SC0CC:1;                 /**< bit:     21  I2SC0 Clock Configuration                     */
    uint32_t I2SC1CC:1;                 /**< bit:     22  I2SC1 Clock Configuration                     */
    uint32_t :9;                        /**< bit: 23..31  Reserved                                      */
  };
  uint32_t w;
} __CCFG_PCCR_bits_t;

#define CCFG_PCCR_TC0CC_Pos                   (20)                                           /**< (CCFG_PCCR) TC0 Clock Configuration Position */
#define CCFG_PCCR_TC0CC_Msk                   (0x1U << CCFG_PCCR_TC0CC_Pos)                  /**< (CCFG_PCCR) TC0 Clock Configuration Mask */
#define CCFG_PCCR_I2SC0CC_Pos                 (21)                                           /**< (CCFG_PCCR) I2SC0 Clock Configuration Position */
#define CCFG_PCCR_I2SC0CC_Msk                 (0x1U << CCFG_PCCR_I2SC0CC_Pos)                /**< (CCFG_PCCR) I2SC0 Clock Configuration Mask */
#define CCFG_PCCR_I2SC1CC_Pos                 (22)                                           /**< (CCFG_PCCR) I2SC1 Clock Configuration Position */
#define CCFG_PCCR_I2SC1CC_Msk                 (0x1U << CCFG_PCCR_I2SC1CC_Pos)                /**< (CCFG_PCCR) I2SC1 Clock Configuration Mask */
#define CCFG_PCCR_Msk                         (0x00700000UL)                                 /**< (CCFG_PCCR) Register Mask  */

/* -------- CCFG_DYNCKG : (MATRIX Offset: 0x11c) (R/W 32) Dynamic Clock Gating Register -------- */

typedef union
{
  struct
  {
    uint32_t MATCKG:1;                  /**< bit:      0  MATRIX Dynamic Clock Gating                   */
    uint32_t BRIDCKG:1;                 /**< bit:      1  Bridge Dynamic Clock Gating Enable            */
    uint32_t EFCCKG:1;                  /**< bit:      2  EFC Dynamic Clock Gating Enable               */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __CCFG_DYNCKG_bits_t;

#define CCFG_DYNCKG_MATCKG_Pos                (0)                                            /**< (CCFG_DYNCKG) MATRIX Dynamic Clock Gating Position */
#define CCFG_DYNCKG_MATCKG_Msk                (0x1U << CCFG_DYNCKG_MATCKG_Pos)               /**< (CCFG_DYNCKG) MATRIX Dynamic Clock Gating Mask */
#define CCFG_DYNCKG_BRIDCKG_Pos               (1)                                            /**< (CCFG_DYNCKG) Bridge Dynamic Clock Gating Enable Position */
#define CCFG_DYNCKG_BRIDCKG_Msk               (0x1U << CCFG_DYNCKG_BRIDCKG_Pos)              /**< (CCFG_DYNCKG) Bridge Dynamic Clock Gating Enable Mask */
#define CCFG_DYNCKG_EFCCKG_Pos                (2)                                            /**< (CCFG_DYNCKG) EFC Dynamic Clock Gating Enable Position */
#define CCFG_DYNCKG_EFCCKG_Msk                (0x1U << CCFG_DYNCKG_EFCCKG_Pos)               /**< (CCFG_DYNCKG) EFC Dynamic Clock Gating Enable Mask */
#define CCFG_DYNCKG_Msk                       (0x00000007UL)                                 /**< (CCFG_DYNCKG) Register Mask  */

/* -------- CCFG_SMCNFCS : (MATRIX Offset: 0x124) (R/W 32) SMC NAND Flash Chip Select Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t SMC_NFCS0:1;               /**< bit:      0  SMC NAND Flash Chip Select 0 Assignment       */
    uint32_t SMC_NFCS1:1;               /**< bit:      1  SMC NAND Flash Chip Select 1 Assignment       */
    uint32_t SMC_NFCS2:1;               /**< bit:      2  SMC NAND Flash Chip Select 2 Assignment       */
    uint32_t SMC_NFCS3:1;               /**< bit:      3  SMC NAND Flash Chip Select 3 Assignment       */
    uint32_t SDRAMEN:1;                 /**< bit:      4  SDRAM Enable                                  */
    uint32_t :27;                       /**< bit:  5..31  Reserved                                      */
  };
  struct
  {
    uint32_t SMC_NFCS:4;                /**< bit:   0..3  SMC NAND Flash Chip Select x Assignment       */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __CCFG_SMCNFCS_bits_t;

#define CCFG_SMCNFCS_SMC_NFCS0_Pos            (0)                                            /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select 0 Assignment Position */
#define CCFG_SMCNFCS_SMC_NFCS0_Msk            (0x1U << CCFG_SMCNFCS_SMC_NFCS0_Pos)           /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select 0 Assignment Mask */
#define CCFG_SMCNFCS_SMC_NFCS1_Pos            (1)                                            /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select 1 Assignment Position */
#define CCFG_SMCNFCS_SMC_NFCS1_Msk            (0x1U << CCFG_SMCNFCS_SMC_NFCS1_Pos)           /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select 1 Assignment Mask */
#define CCFG_SMCNFCS_SMC_NFCS2_Pos            (2)                                            /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select 2 Assignment Position */
#define CCFG_SMCNFCS_SMC_NFCS2_Msk            (0x1U << CCFG_SMCNFCS_SMC_NFCS2_Pos)           /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select 2 Assignment Mask */
#define CCFG_SMCNFCS_SMC_NFCS3_Pos            (3)                                            /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select 3 Assignment Position */
#define CCFG_SMCNFCS_SMC_NFCS3_Msk            (0x1U << CCFG_SMCNFCS_SMC_NFCS3_Pos)           /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select 3 Assignment Mask */
#define CCFG_SMCNFCS_SDRAMEN_Pos              (4)                                            /**< (CCFG_SMCNFCS) SDRAM Enable Position */
#define CCFG_SMCNFCS_SDRAMEN_Msk              (0x1U << CCFG_SMCNFCS_SDRAMEN_Pos)             /**< (CCFG_SMCNFCS) SDRAM Enable Mask */
#define CCFG_SMCNFCS_Msk                      (0x0000001FUL)                                 /**< (CCFG_SMCNFCS) Register Mask  */
#define CCFG_SMCNFCS_SMC_NFCS_Pos             (0)                                            /**< (CCFG_SMCNFCS Position) SMC NAND Flash Chip Select x Assignment */
#define CCFG_SMCNFCS_SMC_NFCS_Msk             (0xFU << CCFG_SMCNFCS_SMC_NFCS_Pos)            /**< (CCFG_SMCNFCS Mask) SMC_NFCS */
#define CCFG_SMCNFCS_SMC_NFCS(value)          (CCFG_SMCNFCS_SMC_NFCS_Msk & ((value) << CCFG_SMCNFCS_SMC_NFCS_Pos))

