zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/matrix.h
/* -------- MATRIX_WPMR : (MATRIX Offset: 0x1e4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __MATRIX_WPMR_bits_t;

#define MATRIX_WPMR_WPEN_Pos                  (0)                                            /**< (MATRIX_WPMR) Write Protection Enable Position */
#define MATRIX_WPMR_WPEN_Msk                  (0x1U << MATRIX_WPMR_WPEN_Pos)                 /**< (MATRIX_WPMR) Write Protection Enable Mask */
#define MATRIX_WPMR_WPKEY_Pos                 (8)                                            /**< (MATRIX_WPMR) Write Protection Key Position */
#define MATRIX_WPMR_WPKEY_Msk                 (0xFFFFFFU << MATRIX_WPMR_WPKEY_Pos)           /**< (MATRIX_WPMR) Write Protection Key Mask */
#define MATRIX_WPMR_WPKEY(value)              (MATRIX_WPMR_WPKEY_Msk & ((value) << MATRIX_WPMR_WPKEY_Pos))
#define   MATRIX_WPMR_WPKEY_PASSWD_Val        (0x4D4154U)                                    /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define MATRIX_WPMR_WPKEY_PASSWD              (MATRIX_WPMR_WPKEY_PASSWD_Val << MATRIX_WPMR_WPKEY_Pos)  /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define MATRIX_WPMR_Msk                       (0xFFFFFF01UL)                                 /**< (MATRIX_WPMR) Register Mask  */

/* -------- MATRIX_WPSR : (MATRIX Offset: 0x1e8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __MATRIX_WPSR_bits_t;

#define MATRIX_WPSR_WPVS_Pos                  (0)                                            /**< (MATRIX_WPSR) Write Protection Violation Status Position */
#define MATRIX_WPSR_WPVS_Msk                  (0x1U << MATRIX_WPSR_WPVS_Pos)                 /**< (MATRIX_WPSR) Write Protection Violation Status Mask */
#define MATRIX_WPSR_WPVSRC_Pos                (8)                                            /**< (MATRIX_WPSR) Write Protection Violation Source Position */
#define MATRIX_WPSR_WPVSRC_Msk                (0xFFFFU << MATRIX_WPSR_WPVSRC_Pos)            /**< (MATRIX_WPSR) Write Protection Violation Source Mask */
#define MATRIX_WPSR_WPVSRC(value)             (MATRIX_WPSR_WPVSRC_Msk & ((value) << MATRIX_WPSR_WPVSRC_Pos))
#define MATRIX_WPSR_Msk                       (0x00FFFF01UL)                                 /**< (MATRIX_WPSR) Register Mask  */

/** \brief MATRIX_PR register offsets definitions */
#define MATRIX_PRAS_OFFSET           (0x00)         /**< (MATRIX_PRAS) Priority Register A for Slave 0 Offset */
#define MATRIX_PRBS_OFFSET           (0x04)         /**< (MATRIX_PRBS) Priority Register B for Slave 0 Offset */
/** \brief MATRIX register offsets definitions */
#define MATRIX_MCFG_OFFSET           (0x00)         /**< (MATRIX_MCFG) Master Configuration Register 0 Offset */
#define MATRIX_SCFG_OFFSET           (0x40)         /**< (MATRIX_SCFG) Slave Configuration Register 0 Offset */
#define MATRIX_MRCR_OFFSET           (0x100)        /**< (MATRIX_MRCR) Master Remap Control Register Offset */
#define CCFG_CAN0_OFFSET             (0x110)        /**< (CCFG_CAN0) CAN0 Configuration Register Offset */
#define CCFG_SYSIO_OFFSET            (0x114)        /**< (CCFG_SYSIO) System I/O and CAN1 Configuration Register Offset */
#define CCFG_PCCR_OFFSET             (0x118)        /**< (CCFG_PCCR) Peripheral Clock Configuration Register Offset */
#define CCFG_DYNCKG_OFFSET           (0x11C)        /**< (CCFG_DYNCKG) Dynamic Clock Gating Register Offset */
#define CCFG_SMCNFCS_OFFSET          (0x124)        /**< (CCFG_SMCNFCS) SMC NAND Flash Chip Select Configuration Register Offset */
#define MATRIX_WPMR_OFFSET           (0x1E4)        /**< (MATRIX_WPMR) Write Protection Mode Register Offset */
#define MATRIX_WPSR_OFFSET           (0x1E8)        /**< (MATRIX_WPSR) Write Protection Status Register Offset */

/** \brief MATRIX_PR register API structure */
typedef struct
{
  __IO  __MATRIX_PRAS_bits_t           MATRIX_PRAS;   /**< Offset: 0x00 (R/W  32) Priority Register A for Slave 0 */
  __IO  __MATRIX_PRBS_bits_t           MATRIX_PRBS;   /**< Offset: 0x04 (R/W  32) Priority Register B for Slave 0 */
} matrixpr_registers_t;

#define MATRIXPR_NUMBER 9
/** \brief MATRIX register API structure */
typedef struct
{
  __IO  __MATRIX_MCFG_bits_t           MATRIX_MCFG[12]; /**< Offset: 0x00 (R/W  32) Master Configuration Register 0 */
  __I   uint8_t                        Reserved1[0x10];
  __IO  __MATRIX_SCFG_bits_t           MATRIX_SCFG[9]; /**< Offset: 0x40 (R/W  32) Slave Configuration Register 0 */
  __I   uint8_t                        Reserved2[0x1C];
        matrixpr_registers_t           MATRIX_PR[MATRIXPR_NUMBER]; /**< Offset: 0x80 Priority Register A for Slave 0 */
  __I   uint8_t                        Reserved3[0x38];
  __IO  __MATRIX_MRCR_bits_t           MATRIX_MRCR;   /**< Offset: 0x100 (R/W  32) Master Remap Control Register */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  __CCFG_CAN0_bits_t             CCFG_CAN0;     /**< Offset: 0x110 (R/W  32) CAN0 Configuration Register */
  __IO  __CCFG_SYSIO_bits_t            CCFG_SYSIO;    /**< Offset: 0x114 (R/W  32) System I/O and CAN1 Configuration Register */
  __IO  __CCFG_PCCR_bits_t             CCFG_PCCR;     /**< Offset: 0x118 (R/W  32) Peripheral Clock Configuration Register */
  __IO  __CCFG_DYNCKG_bits_t           CCFG_DYNCKG;   /**< Offset: 0x11C (R/W  32) Dynamic Clock Gating Register */
  __I   uint8_t                        Reserved5[0x04];
  __IO  __CCFG_SMCNFCS_bits_t          CCFG_SMCNFCS;  /**< Offset: 0x124 (R/W  32) SMC NAND Flash Chip Select Configuration Register */
  __I   uint8_t                        Reserved6[0xBC];
  __IO  __MATRIX_WPMR_bits_t           MATRIX_WPMR;   /**< Offset: 0x1E4 (R/W  32) Write Protection Mode Register */
  __I   __MATRIX_WPSR_bits_t           MATRIX_WPSR;   /**< Offset: 0x1E8 (R/   32) Write Protection Status Register */
} matrix_registers_t;
/** @}  end of AHB Bus Matrix */

#endif /* _PIC32CZ_CA70_MATRIX_COMPONENT_H_ */
